{
  "about": {
    "dataSource1Description": "Official shelter location data provided by the Geospatial Information Authority of Japan, covering over 110,000 designated emergency evacuation sites across the country.",
    "dataSource1Title": "Geospatial Information Authority of Japan",
    "dataSource2Description": "Gemini 2.5 Flash for disaster scenario and badge prompt generation. Flux.1 Schnell for fast, high-quality shelter badge image generation.",
    "dataSource2Title": "AI Models",
    "dataSourcesSubtitle": "Reliable data sources powering HiNan!",
    "dataSourcesTitle": "Data Sources",
    "member1Name": "Win (itzmeowww)",
    "member1Responsibility": "Frontend and iOS app development (login system, navigation, settings page, map functionality), website development, and App Store submission.",
    "member1Role": "Frontend & iOS Developer",
    "member2Name": "Martyna (martgru)",
    "member2Responsibility": "iOS development with SwiftUI, audio effects implementation, user profile enhancements, multilingual support, and UI/UX design.",
    "member2Role": "iOS Developer & Designer",
    "member3Name": "Rio (りおちん)",
    "member3Responsibility": "iOS development, ranking system, team functions, multiplayer mode, shelter incentives, badge map icons, and mission mechanics.",
    "member3Role": "iOS Developer",
    "member4Name": "June (Cerealmaster0621)",
    "member4Responsibility": "iOS development, final score formulas, ranking algorithms, points system implementation, and game balance.",
    "member4Role": "iOS Developer",
    "member5Name": "Jeffrey (RedBlueBird)",
    "member5Responsibility": "Full-stack development, social media sharing features, shelter rating system, comment reporting features, and user profile page.",
    "member5Role": "Full-stack Developer",
    "subtitle": "Meet the team behind HiNan! and learn about our technology",
    "teamSubtitle": "A multinational team passionate about disaster preparedness",
    "teamTitle": "Our Team",
    "techStack1Description": "SwiftUI, MapKit",
    "techStack1Title": "Frontend",
    "techStack2Description": "Supabase (User, Badge, Event Management)",
    "techStack2Title": "Backend",
    "techStack3Description": "Gemini 2.5 Flash, Flux.1 Schnell",
    "techStack3Title": "AI & Machine Learning",
    "techStackTitle": "Technology Stack",
    "title": "About HiNan!",
    "visitWebsite": "Visit Website"
  },
  "demo": {
    "hackDayFeaturesSubtitle": "During the Hack Day event, we built these core features to make evacuation drills engaging and practical.",
    "hackDayFeaturesTitle": "Features Built During Hack Day",
    "hackFeature1Description": "Real-time location tracking with interactive map visualization that simulates disaster scenarios, including zombie AI pathfinding algorithms that chase users.",
    "hackFeature1Title": "Interactive Map Mission System",
    "hackFeature2Description": "AI-powered badge generation for each shelter with unique designs. Collect badges by visiting shelters and leave your name on new discoveries.",
    "hackFeature2Title": "Collectible Shelter Badges",
    "hackFeature3Description": "Gemini AI generates daily disaster scenarios in JSON format, providing realistic and location-specific evacuation training experiences.",
    "hackFeature3Title": "AI Scenario Generation",
    "hackFeature4Description": "Full support for Japanese and English, making the app accessible to foreign residents and enabling our multinational team to collaborate effectively.",
    "hackFeature4Title": "Multilingual Support",
    "hackFeature6Description": "Clean architecture with separated communication logic using Observable pattern, smart timezone-aware mission queries, and automatic mission generation.",
    "hackFeature6Title": "Robust Backend Architecture",
    "improvementFeature10Description": "Display generated badges as icons on the map, making it easier to identify and collect badges from different shelters.",
    "improvementFeature10Title": "Badge Map Icons",
    "improvementFeature11Description": "Users who visit shelters can leave authentic ratings and reviews, helping others make informed decisions during emergencies.",
    "improvementFeature11Title": "Shelter Comments & Ratings",
    "improvementFeature1Description": "Track distance traveled and steps taken during evacuation drills for better fitness integration and progress tracking.",
    "improvementFeature1Title": "Distance & Steps Tracking",
    "improvementFeature3Description": "Enhanced ranking system with national rankings, team rankings (inside & outside organizations), shelter rankings, and improved final score formulas.",
    "improvementFeature3Title": "Advanced Ranking System",
    "improvementFeature4Description": "Share your evacuation drill results on social media platforms to encourage friends and build community awareness.",
    "improvementFeature4Title": "Social Media Sharing",
    "improvementFeature6Description": "Enhanced user profile page with more customization options, including setting your favorite badge as your profile icon.",
    "improvementFeature6Title": "User Profile Enhancements",
    "improvementFeature7Description": "Multiple game modes including Zen Mode (no mission start required), Mapless Mode, and Multiplayer Mode for corporate teams.",
    "improvementFeature7Title": "Multiple Game Modes",
    "improvementFeature8Description": "Incentives to revisit shelters with star collection system, scenario-based achievements, and shelter-specific rankings.",
    "improvementFeature8Title": "Shelter Visit Incentives",
    "improvementFeature9Description": "Form teams with friends or organizations, perfect for corporate wellness programs with business division integration.",
    "improvementFeature9Title": "Team Function",
    "improvementSubtitle": "We are continuously improving HiNan! to make it more impactful, easy to use, and fun to use.",
    "improvementTitle": "Improvement Sprint Features",
    "subtitle": "Watch our demo video and explore the features we built during the Hack Day event.",
    "title": "Demo"
  },
  "homepage": {
    "description": "HiNan! is a mobile app that makes evacuation drills fun, repeatable, and healthy by walking to nearby shelters based on AI-generated scenarios through gamification.",
    "feature1Description": "Practice realistic evacuation scenarios tailored to your location and environment",
    "feature1Title": "AI-Generated Scenarios",
    "feature2Description": "Earn badges and track your progress while making safety training fun",
    "feature2Title": "Gamification",
    "feature3Description": "Combine safety drills with physical exercise by walking to real shelters",
    "feature3Title": "Walk & Stay Healthy",
    "featuresDescription": "Turn evacuation drills into an engaging, healthy habit",
    "featuresTitle": "Why HiNan!?",
    "learnMore": "Learn More",
    "tagline": "Make evacuation drills a habit by walking",
    "title": "Welcome",
    "tryDemo": "Try Demo"
  },
  "metadata": {
    "description": "HiNan! is a mobile app that makes evacuation drills fun, repeatable, and healthy by walking to nearby shelters based on AI-generated scenarios through gamification.",
    "title": "HiNan! - Make evacuation drills a habit by walking"
  },
  "navbar": {
    "about": "About",
    "credits": "Credits",
    "demo": "Demo",
    "features": "Features",
    "privacy": "Privacy Policy",
    "terms": "Terms of Service"
  },
  "privacy": {
    "changesToPolicyPara1": "We may update this Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page and updating the \"Last Updated\" date.",
    "changesToPolicyPara2": "You are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page.",
    "changesToPolicyTitle": "Changes to This Policy",
    "commitmentPara1": "At HiNan!, we take your privacy seriously. This Privacy Policy explains how we collect, use, disclose, and safeguard your information when you use our mobile application and services. We are committed to protecting your data and being transparent about our practices.",
    "commitmentPara2": "By using HiNan!'s services, you agree to the collection and use of information in accordance with this policy. If you do not agree with our policies and practices, please do not use our services.",
    "commitmentTitle": "Our Commitment to Privacy",
    "contactEmail": "Email:",
    "contactResponseTime": "Response Time: We aim to respond within 72 hours",
    "contactUsPara": "If you have any questions about this Privacy Policy, need to report a privacy concern, or want to exercise any of your rights regarding your personal data, please contact us:",
    "contactUsSubtitle": "Questions about our privacy practices or want to exercise your rights?",
    "contactUsTitle": "Contact Us",
    "dataRetention1": "User data is retained as long as your account is active",
    "dataRetention2": "Historical logs are retained for up to 30 days for debugging purposes",
    "dataRetention3": "Inactive accounts are automatically removed after 12 months",
    "dataRetention4": "You can request immediate data deletion by contacting us",
    "dataRetentionTitle": "Data Retention",
    "dataSecurity1": "All data is transmitted using secure HTTPS connections",
    "dataSecurity2": "Access to sensitive data is restricted to authorized personnel only",
    "dataSecurity3": "Regular security audits and monitoring of our systems",
    "dataSecurity4": "Data is stored securely with industry-standard encryption",
    "dataSecurityTitle": "Data Security",
    "howWeUse1": "Provide location-based services and recommendations",
    "howWeUse2": "Personalize your experience and content",
    "howWeUse3": "Improve and optimize app performance and features",
    "howWeUse4": "Monitor system health and troubleshoot technical issues",
    "howWeUseTitle": "How We Use Your Information",
    "infoCollect1": "Location data when you use map features (with your permission)",
    "infoCollect2": "Device information (device type, OS version, unique identifiers)",
    "infoCollect3": "Usage data (features used, time spent, interaction patterns)",
    "infoCollect4": "User-generated content (places you save, notes, photos)",
    "infoCollectTitle": "Information We Collect",
    "infoSharing1": "We do not sell, trade, or share your personal information with third parties for commercial purposes",
    "infoSharing2": "Location data is shared with map providers (Google Maps, Apple Maps) as required for functionality",
    "infoSharing3": "Anonymized usage statistics may be shared for research or improvement purposes",
    "infoSharing4": "We may disclose information if required by law or to protect our rights",
    "infoSharingTitle": "Information Sharing",
    "lastUpdated": "Last Updated: October 27, 2025",
    "locationData1": "Your location is only collected when you use map-based features",
    "locationData2": "This data helps provide accurate directions and nearby recommendations",
    "locationData3": "Location data is shared with mapping service providers for route calculation",
    "locationData4": "You can disable location access at any time in your device settings",
    "locationDataTitle": "Location Data Usage",
    "subtitle": "How we collect, use, and protect your information",
    "title": "Privacy Policy",
    "yourRights1": "Request deletion of your data at any time",
    "yourRights2": "Disable location tracking in your device settings",
    "yourRights3": "Request a copy of the data we have collected about you",
    "yourRights4": "Contact us to correct any inaccurate information",
    "yourRightsTitle": "Your Rights"
  },
  "tos": {
    "accountTermination1": "You may delete your account at any time through the app settings",
    "accountTermination2": "We reserve the right to suspend or terminate accounts for ToS violations",
    "accountTermination3": "Termination does not relieve you of obligations incurred before termination",
    "accountTermination4": "Upon termination, your data will be deleted according to our Privacy Policy",
    "accountTerminationTitle": "Account Termination",
    "agreementPara1": "By accessing or using HiNan! mobile application and services, you agree to be bound by these Terms of Service. These terms apply to all users of the app, including visitors, registered users, and any other individuals who access the service.",
    "agreementPara2": "If you do not agree with any part of these terms, you must not use our application. Your continued use of HiNan! constitutes acceptance of any changes to these terms.",
    "agreementTitle": "Agreement to Terms",
    "changesToTermsPara1": "We reserve the right to modify or replace these Terms of Service at any time. We will provide notice of any material changes by posting the new terms on this page and updating the \"Last Updated\" date.",
    "changesToTermsPara2": "Your continued use of HiNan! after any changes become effective constitutes acceptance of the new terms. If you do not agree to the new terms, you must stop using the app.",
    "changesToTermsTitle": "Changes to These Terms",
    "contactEmail": "Email:",
    "contactResponseTime": "Response Time: We aim to respond within 72 hours",
    "contactUsPara": "If you have any questions about these Terms of Service or need clarification on any provisions, please contact us:",
    "contactUsSubtitle": "Questions or concerns about these Terms of Service?",
    "contactUsTitle": "Contact Us",
    "governingLawPara1": "These Terms of Service shall be governed by and construed in accordance with the laws of Japan, without regard to its conflict of law provisions.",
    "governingLawPara2": "Any disputes arising from these terms or your use of HiNan! shall be resolved through binding arbitration in accordance with the rules of the Japan Commercial Arbitration Association.",
    "governingLawTitle": "Governing Law",
    "intellectualProperty1": "All content and materials in the app are our property",
    "intellectualProperty2": "Trademarks, logos, and service marks are protected",
    "intellectualProperty3": "You retain ownership of content you create within the app",
    "intellectualProperty4": "By using the app, you grant us a license to use your content for service operation",
    "intellectualPropertyTitle": "Intellectual Property",
    "lastUpdated": "Last Updated: October 27, 2025",
    "limitationLiability1": "HiNan! is provided \"as is\" without warranties of any kind",
    "limitationLiability2": "We are not liable for any indirect, incidental, or consequential damages",
    "limitationLiability3": "Not responsible for losses resulting from unauthorized access to your account",
    "limitationLiability4": "Maximum liability limited to the amount you paid for the service (if any)",
    "limitationLiabilityTitle": "Limitation of Liability",
    "prohibitedUses1": "Using the app for any unlawful or fraudulent purpose",
    "prohibitedUses2": "Attempting to gain unauthorized access to our systems",
    "prohibitedUses3": "Uploading malicious code, viruses, or harmful content",
    "prohibitedUses4": "Harassing, threatening, or abusing other users",
    "prohibitedUses5": "Scraping or extracting data through automated means",
    "prohibitedUsesTitle": "Prohibited Uses",
    "serviceAvailability1": "We strive to provide reliable service but cannot guarantee 100% uptime",
    "serviceAvailability2": "Maintenance and updates may temporarily interrupt service",
    "serviceAvailability3": "We reserve the right to modify or discontinue features",
    "serviceAvailability4": "No warranty is provided for uninterrupted or error-free service",
    "serviceAvailabilityTitle": "Service Availability",
    "subtitle": "Please read these terms carefully before using HiNan!",
    "thirdPartyServices1": "The app may contain links to third-party services",
    "thirdPartyServices2": "We are not responsible for third-party content or services",
    "thirdPartyServices3": "Use of third-party services is subject to their own terms",
    "thirdPartyServices4": "Integration with map services (Google Maps, Apple Maps) is provided as-is",
    "thirdPartyServicesTitle": "Third-Party Services",
    "title": "Terms of Service",
    "useLicense1": "Personal, non-commercial use of the application is permitted",
    "useLicense2": "You may not modify, copy, or distribute the app without permission",
    "useLicense3": "This license may be terminated if you violate any restrictions",
    "useLicense4": "All intellectual property rights belong to HiNan!",
    "useLicenseTitle": "Use License",
    "userObligations1": "Provide accurate and truthful information",
    "userObligations2": "Maintain the security of your account credentials",
    "userObligations3": "Use the app in compliance with all applicable laws",
    "userObligations4": "Respect other users and community guidelines",
    "userObligationsTitle": "User Obligations"
  }
}
